app/controllers/user_controller.rb

  def companies
    @companies = Company.find :all, :conditions => ['name like ?',"%#{params[:search]}%"]
---
SELECT * FROM `companies` WHERE (name like '%s%')

  def data_loader
    @company = Company.find_by_name params[:id]
---
SELECT * FROM `companies` WHERE (`companies`.`name` = 'spritle') LIMIT 1

  def create
    temp = Company.find_by_name params[:company][:name]
    if temp.nil?
      company = Company.new(params[:company])
      company.save
      company_id = company.id
    else
      company_id = temp.id
    end
    user = User.new(params[:user])
    user.company_id = company_id
    user.save
---
SELECT * FROM `companies` WHERE (`companies`.`name` = 'Google') LIMIT 1
INSERT INTO `companies` (`name`, `address1`, `address2`, `country`) VALUES('Google', 'test', 'newyork', 'USA')
INSERT INTO `users` (`name`, `updated_at`, `company_id`, `age`, `created_at`) VALUES('test', '2009-06-25 07:22:48', 3, 23, '2009-06-25 07:22:48')